
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>非同期ジョブシステム設計 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-codeblock-filename/block.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="reference.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    本資料について
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="design.html">
            
                <a href="design.html">
            
                    
                    非同期ジョブシステム設計
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="reference.html">
            
                <a href="reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >非同期ジョブシステム設計</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x8A2D;&#x8A08;">&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x8A2D;&#x8A08;</h1>
<h2 id="&#x8981;&#x4EF6;">&#x8981;&#x4EF6;</h2>
<ul>
<li>&#x8907;&#x6570;&#x306E; Web &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304B;&#x3089;&#x5171;&#x901A;&#x3067;&#x4F7F;&#x3048;&#x308B;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x57FA;&#x76E4;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;<ul>
<li>&#x5BFE;&#x8C61;&#x3068;&#x306A;&#x308B;&#x306E;&#x306F;&#x6642;&#x9593;&#x304C;&#x304B;&#x304B;&#x308B;&#x51E6;&#x7406;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;&#x52D5;&#x753B;&#x306E;&#x30A8;&#x30F3;&#x30B3;&#x30FC;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x3084;&#x5927;&#x91CF;&#x306E;&#x30B5;&#x30E0;&#x30CD;&#x30A4;&#x30EB;&#x306E;&#x4F5C;&#x6210;&#x306A;&#x3069;&#x3002;</li>
</ul>
</li>
<li>&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x6557;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B; 5 &#x56DE;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x3059;&#x308B;</li>
<li>5 &#x56DE;&#x5931;&#x6557;&#x3057;&#x305F;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x7BA1;&#x7406;&#x8005;&#x306B;&#x30A8;&#x30E9;&#x30FC;&#x901A;&#x77E5;&#x3059;&#x308B;</li>
<li>&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x7D42;&#x4E86;&#x3057;&#x305F;&#x3089;&#x3001;&#x6210;&#x5426;&#x306B;&#x95A2;&#x308F;&#x3089;&#x305A;&#x7D50;&#x679C;&#x3092;&#x30E6;&#x30FC;&#x30B6;&#x306B;&#x901A;&#x77E5;&#x3057;&#x305F;&#x3044;&#x3002;<ul>
<li>&#x3053;&#x308C;&#x306F;&#x53EF;&#x80FD;&#x304B;&#xFF1F;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x5236;&#x7D04;&#x3092;&#x3064;&#x3051;&#x308C;&#x3070;&#x5B9F;&#x73FE;&#x3067;&#x304D;&#x308B;&#x304B;&#xFF1F;</li>
</ul>
</li>
</ul>
<h2 id="&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#x69CB;&#x6210;&#x56F3;">&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#x69CB;&#x6210;&#x56F3;</h2>
<p><img src="assets/module-diagram.svg" alt=""></p>
<h3 id="&#x5404;&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#x306E;&#x4E3B;&#x306A;&#x5F79;&#x5272;">&#x5404;&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#x306E;&#x4E3B;&#x306A;&#x5F79;&#x5272;</h3>
<ul>
<li>Web Application</li>
</ul>
<p>&#x30A6;&#x30A7;&#x30D6;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3002;&#x672C;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x7528;&#x3044;&#x308B;&#x4E3B;&#x4F53;&#x3002;<br>
&#x8907;&#x6570;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x304C;&#x7ACB;&#x3061;&#x4E0A;&#x304C;&#x3063;&#x3066;&#x3044;&#x308B;&#x7B49;&#x3057;&#x3066;&#x3001;&#x8907;&#x6570;&#x540C;&#x6642;&#x306B;&#x5B58;&#x5728;&#x3059;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x3082;&#x3042;&#x308B;&#x3068;&#x3059;&#x308B;&#x3002;</p>
<ul>
<li>Load Balancer</li>
</ul>
<p>&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x5165;&#x308A;&#x53E3;&#x306B;&#x306A;&#x308B;&#x5F8C;&#x8FF0;&#x306E; API Server &#x306F;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3059;&#x308B;&#x7B49;&#x3067;&#x8907;&#x6570;&#x306B;&#x306A;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x3002;<br>
&#x8CA0;&#x8377;&#x3092;&#x5206;&#x6563;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x30ED;&#x30FC;&#x30C9;&#x30D0;&#x30E9;&#x30F3;&#x30B5;&#x30FC;&#x3092;&#x7F6E;&#x304F;&#x3002;</p>
<ul>
<li>API Server</li>
</ul>
<p>&#x672C;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x5165;&#x308A;&#x53E3;&#x3002;RESTful &#x3042;&#x308B;&#x3044;&#x306F; gRPC &#x7B49;&#x306E;&#x5F62;&#x3067; API &#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x3002;<br>
&#x5927;&#x91CF;&#x306B;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x304C;&#x304F;&#x308B;&#x5834;&#x5408;&#x306B;&#x5099;&#x3048;&#x3066;&#x3001;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3084;&#x3059;&#x3044;&#x3088;&#x3046; CRUD &#x3068;&#x5207;&#x308A;&#x96E2;&#x3057;&#x305F;&#x5F62;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;<br></p>
<p>&#x4E3B;&#x306A;&#x6A5F;&#x80FD;&#x306F;&#x4EE5;&#x4E0B;&#x3002;</p>
<pre><code>- &#x30B8;&#x30E7;&#x30D6;&#x767B;&#x9332;
- &#x5B9F;&#x884C;&#x5F85;&#x3061;&#x30B8;&#x30E7;&#x30D6;&#x53D6;&#x308A;&#x51FA;&#x3057;
- &#x30B8;&#x30E7;&#x30D6;&#x72B6;&#x614B;&#x5909;&#x66F4;
- &#x30B8;&#x30E7;&#x30D6;&#x72B6;&#x614B;&#x78BA;&#x8A8D;
</code></pre><ul>
<li>Job Queue / DB</li>
</ul>
<p>&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x3044;&#x3063;&#x305F;&#x3093;&#x84C4;&#x3048;&#x308B;&#x305F;&#x3081;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3068; DB&#x3002;RESTful &#x3042;&#x308B;&#x3044;&#x306F; gRPC &#x7B49;&#x306E;&#x5F62;&#x3067; API &#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x3002;<br>
API Server &#x304B;&#x3089;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x3002;CRUD &#x90E8;&#x5206;&#x3002;</p>
<p>&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x72B6;&#x614B;&#x3092;&#x6301;&#x3064;&#x3002;</p>
<pre><code>- &#x5B9F;&#x884C;&#x5F85;&#x3061;
  - &#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x306B;&#x3088;&#x3063;&#x3066;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x306E;&#x3092;&#x5F85;&#x3063;&#x3066;&#x3044;&#x308B;&#x72B6;&#x614B;&#x306E;&#x30B8;&#x30E7;&#x30D6;
- &#x5B9F;&#x884C;&#x4E2D;
  - &#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x5B9F;&#x884C;&#x4E2D;&#x306E;&#x30B8;&#x30E7;&#x30D6;
  - &#x4E00;&#x5B9A;&#x671F;&#x9593;&#x304C;&#x904E;&#x304E;&#x308B;&#x3068;&#x300C;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x300D;&#x306B;&#x623B;&#x308B;
- &#x6B63;&#x5E38;&#x7D42;&#x4E86;
- &#x5931;&#x6557;&#x7D42;&#x4E86;
 - &#x30A8;&#x30E9;&#x30FC;&#x7406;&#x7531;&#x3092;&#x6DFB;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;
</code></pre><ul>
<li>Worker</li>
</ul>
<p>&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x90E8;&#x5206;&#x3002;<br>
API Server &#x306B;&#x5B9A;&#x671F;&#x7684;&#x306B;&#x76E3;&#x8996;&#x3057; (&#x3042;&#x308B;&#x3044;&#x306F; API Server &#x304B;&#x3089;&#x306E;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;)&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x6295;&#x5165;&#x3055;&#x308C;&#x3066;&#x3044;&#x308C;&#x3070;&#x53D6;&#x308A;&#x51FA;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;<br>
API Server &#x306E; API &#x3092;&#x7528;&#x3044;&#x3066;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x5B9F;&#x884C;&#x7D50;&#x679C;&#x3092; DB &#x306B;&#x53CD;&#x6620;&#x3059;&#x308B;&#x3002;</p>
<h2 id="&#x4E3B;&#x8981;&#x6A5F;&#x80FD;&#x306E;&#x30B7;&#x30FC;&#x30B1;&#x30F3;&#x30B9;&#x56F3;">&#x4E3B;&#x8981;&#x6A5F;&#x80FD;&#x306E;&#x30B7;&#x30FC;&#x30B1;&#x30F3;&#x30B9;&#x56F3;</h2>
<p><img src="assets/images/uml/801b8e9fcafde066d3de3713cda74af1930d7fdb.svg"></p>
<h2 id="&#x7BA1;&#x7406;&#x8005;&#x3078;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x901A;&#x77E5;">&#x7BA1;&#x7406;&#x8005;&#x3078;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x901A;&#x77E5;</h2>
<p>&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x3001;&#x898F;&#x5B9A;&#x306E;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x56DE;&#x6570; (5 &#x56DE;) &#x3092;&#x4E0A;&#x56DE;&#x3063;&#x3066;&#x5931;&#x6557;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;API Server &#x306F;&#x7BA1;&#x7406;&#x8005;&#x306B;&#x30A8;&#x30E9;&#x30FC;&#x3092;&#x901A;&#x77E5;&#x3059;&#x308B;&#x3002;
&#x30A8;&#x30E9;&#x30FC;&#x901A;&#x77E5;&#x306E;&#x65B9;&#x6CD5;&#x306F;&#x3001;&#x30E1;&#x30FC;&#x30EB;&#x3001;Slack &#x7B49;&#x3078;&#x306E;&#x30DD;&#x30B9;&#x30C8;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;&#x3002;</p>
<ul>
<li>&#x9001;&#x4FE1;&#x5148;&#x304C;&#x5927;&#x91CF;&#x3067;&#x3042;&#x308B;&#x7B49;&#x3067;&#x305D;&#x308C;&#x306A;&#x308A;&#x306B;&#x901A;&#x77E5;&#x51E6;&#x7406;&#x306B;&#x6642;&#x9593;&#x304C;&#x639B;&#x304B;&#x308B;&#x3053;&#x3068;&#x304C;&#x60F3;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x5225;&#x9014;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x7528;&#x3044;&#x3066;&#x901A;&#x77E5;&#x51E6;&#x7406;&#x3092;&#x884C;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x305D;&#x3046;&#x3002;</li>
</ul>
<h2 id="&#x30B8;&#x30E7;&#x30D6;&#x7D42;&#x4E86;&#x6642;&#x306E;&#x7D50;&#x679C;&#x901A;&#x77E5;">&#x30B8;&#x30E7;&#x30D6;&#x7D42;&#x4E86;&#x6642;&#x306E;&#x7D50;&#x679C;&#x901A;&#x77E5;</h2>
<p>&#x5148;&#x8FF0;&#x306E;&#x30B7;&#x30FC;&#x30B1;&#x30F3;&#x30B9;&#x56F3;&#x3067;&#x306F;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x6210;&#x5426;&#x3001;&#x306A;&#x3044;&#x3057;&#x9032;&#x6357;&#x306E;&#x78BA;&#x8A8D;&#x306F;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x72B6;&#x614B;&#x53D6;&#x5F97; API &#x3092;&#x9010;&#x6B21;&#x5B9F;&#x884C;&#x3059;&#x308B; (&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;) &#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x306A;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>&#x4E00;&#x65B9;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5B8C;&#x4E86;&#x3057;&#x6B21;&#x7B2C;&#x901A;&#x77E5;&#x3059;&#x308B;&#x5F62; (&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5074;&#x304B;&#x3089;&#x306E;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;) &#x3092;&#x8003;&#x3048;&#x308B;&#x5834;&#x5408;&#x3001;&#x4F8B;&#x3048;&#x3070;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x65B9;&#x5F0F;&#x3067;&#x5B9F;&#x73FE;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<ul>
<li><p>WebSocket&#x3001;gRPC &#x306E; stream &#x3067; push &#x901A;&#x77E5;</p>
<ul>
<li>&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x5F35;&#x308A;&#x3063;&#x3071;&#x306A;&#x3057;&#x7CFB;&#x306E;&#x5B9F;&#x73FE;&#x65B9;&#x6CD5;&#x3002;&#x51E6;&#x7406;&#x304C;&#x7D42;&#x308F;&#x308A;&#x6B21;&#x7B2C;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5074;&#x304B;&#x3089; push &#x3067;&#x901A;&#x77E5;&#x3059;&#x308B;&#x3002;</li>
<li>&#x7D50;&#x679C;&#x3092;&#x901A;&#x77E5;&#x3059;&#x308B;&#x524D;&#x306B;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x5207;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x5834;&#x5408;&#x306F;&#x3001;&#x8CBC;&#x308A;&#x76F4;&#x3059;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;&#x7D50;&#x679C;&#x901A;&#x77E5;&#x6642;&#x306B;&#x306F;&#x5C11;&#x306A;&#x304F;&#x3068;&#x3082;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x5F35;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</li>
<li>&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x5F35;&#x3089;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x7D50;&#x679C;&#x306E;&#x901A;&#x77E5;&#x304C;&#x884C;&#x308F;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x5834;&#x5408;&#x306B;&#x3001;&#x7D50;&#x679C;&#x304C;&#x5931;&#x308F;&#x308C;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x30B1;&#x30A2;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</li>
</ul>
</li>
<li><p>Webhook &#x3092;&#x7528;&#x3044;&#x3066;&#x7D50;&#x679C;&#x3092;&#x901A;&#x77E5;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x6295;&#x5165;&#x6642;&#x306B;&#x7D50;&#x679C;&#x901A;&#x77E5;&#x5148;&#x306E; URL (Webhook &#x9001;&#x4ED8;&#x5148;&#x3068;&#x306A;&#x308B;) &#x3092;&#x6DFB;&#x3048;&#x3066;&#x304A;&#x304F;&#x65B9;&#x5F0F;&#x3002;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x3001;&#x3082;&#x3057;&#x304F;&#x306F; API Server &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F; URL &#x306B;&#x30B8;&#x30E7;&#x30D6;&#x5B9F;&#x884C;&#x7D50;&#x679C;&#x3092;&#x30DD;&#x30B9;&#x30C8;&#x3059;&#x308B;&#x3002;</li>
<li>&#x901A;&#x77E5;&#x5148;&#x306E; URL &#x304C;&#x4F55;&#x3089;&#x304B;&#x306E;&#x7406;&#x7531;&#x3067;&#x30EA;&#x30FC;&#x30C1;&#x3067;&#x304D;&#x306A;&#x3044; (&#x6307;&#x5B9A;&#x306B;&#x8AA4;&#x308A;&#x304C;&#x3042;&#x308B;&#x3001;&#x30C0;&#x30A6;&#x30F3;&#x3057;&#x3066;&#x3044;&#x308B;&#x3001;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x4E0D;&#x8ABF;&#x3001;&#x306A;&#x3069;) &#x5834;&#x5408;&#x306B;&#x3001;&#x7D50;&#x679C;&#x304C;&#x5931;&#x308F;&#x308C;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x30B1;&#x30A2;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</li>
</ul>
</li>
</ul>
<h2 id="&#x8AF8;&#x3005;&#x88DC;&#x8DB3;">&#x8AF8;&#x3005;&#x88DC;&#x8DB3;</h2>
<ul>
<li><p>Worker &#x306F;&#x3001;&#x51E6;&#x7406;&#x5185;&#x5BB9;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x5927;&#x91CF;&#x306B;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x304C;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x308B;&#x5834;&#x5408;&#x3082;&#x3042;&#x308A;&#x3048;&#x305D;&#x3046;&#x306A;&#x305F;&#x3081;&#x3001;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3084;&#x3059;&#x3044;&#x5F62;&#x306B;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;</p>
<ul>
<li>CRUD &#x90E8;&#x5206;&#x306F;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x306B;&#x304F;&#x3044; (&#x3057;&#x3066;&#x3082;&#x6027;&#x80FD;&#x304C;&#x3042;&#x304C;&#x3089;&#x306A;&#x3044;&#x53EF;&#x80FD;&#x6027;) &#x5834;&#x5408;&#x304C;&#x3042;&#x308B;&#x3068;&#x601D;&#x308F;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;CRUD &#x3068; Worker &#x3092;&#x5206;&#x3051;&#x3066;&#x304A;&#x304F;&#x307B;&#x3046;&#x304C;&#x90FD;&#x5408;&#x304C;&#x826F;&#x3044;</li>
<li>&#x3068;&#x3044;&#x3046;&#x7406;&#x7531;&#x3067;&#x3001;Job Queue &#x3068; Worker &#x304C;&#x5206;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x69CB;&#x6210;&#x3092;&#x691C;&#x8A0E;&#x3057;&#x305F;</li>
</ul>
</li>
<li><p>Job Queue &#x306F;&#x3001;&#x6295;&#x5165;&#x3055;&#x308C;&#x305F;&#x30B8;&#x30E7;&#x30D6;&#x3092; DB &#x306B;&#x5165;&#x308C;&#x3066;&#x6C38;&#x7D9A;&#x5316;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3068;&#x3057;&#x3066;&#x60F3;&#x5B9A;&#x3057;&#x305F;</p>
<ul>
<li>&#x30AA;&#x30F3;&#x30E1;&#x30E2;&#x30EA;&#x3067;&#x3082;&#x3042;&#x308B;&#x7A0B;&#x5EA6;&#x53EF;&#x80FD;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x304C;&#x3001;Job Queue &#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x304C;&#x6B7B;&#x306C;&#x3068;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x308F;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x3063;&#x305F;&#x308A;&#x3001;&#x5927;&#x91CF;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x6295;&#x5165;&#x3055;&#x308C;&#x305F;&#x3068;&#x304D;&#x306B;&#x30E1;&#x30E2;&#x30EA;&#x306B;&#x4FDD;&#x6301;&#x3057;&#x304D;&#x308C;&#x306A;&#x304F;&#x306A;&#x308B;&#x3001;&#x7B49;&#x306E;&#x7406;&#x7531;&#x3067;&#x30AA;&#x30B9;&#x30B9;&#x30E1;&#x3067;&#x304D;&#x306A;&#x3044;&#x3068;&#x8003;&#x3048;&#x305F;</li>
</ul>
</li>
<li><p>&#x300C;&#x5B9F;&#x884C;&#x4E2D;&#x300D;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x306B;&#x3064;&#x3044;&#x3066;</p>
<ul>
<li>Worker &#x304C;&#x30B8;&#x30E7;&#x30D6;&#x5B9F;&#x884C;&#x9014;&#x4E2D;&#x3067;&#x6B7B;&#x3093;&#x3067;&#x3057;&#x307E;&#x3063;&#x305F;&#x308A;&#x3001;&#x901A;&#x4FE1;&#x4E0D;&#x8ABF;&#x7B49;&#x306E;&#x7406;&#x7531;&#x3067;&#x5B9F;&#x884C;&#x7D50;&#x679C;&#x306E;&#x901A;&#x77E5;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5B9F;&#x884C;&#x4E2D;&#x306E;&#x307E;&#x307E;&#x306B;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;</li>
<li>&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x300C;&#x5B9F;&#x884C;&#x4E2D;&#x300D;&#x72B6;&#x614B;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x4E00;&#x5B9A;&#x671F;&#x9593;&#x304C;&#x904E;&#x304E;&#x308B;&#x3068;&#x300C;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x300D;&#x306B;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x623B;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;</li>
<li>&#x300C;&#x4E00;&#x5B9A;&#x671F;&#x9593;&#x300D;&#x306F;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x767B;&#x9332;&#x6642;&#x306B;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3068;&#x3057;&#x3066;&#x6DFB;&#x3048;&#x3089;&#x308C;&#x308B; (Web Application &#x304C;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x308B;) &#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;</li>
<li><p>Worker &#x306F;&#x3001;&#x4E00;&#x5B9A;&#x671F;&#x9593;&#x304C;&#x904E;&#x304E;&#x305F;&#x30B8;&#x30E7;&#x30D6;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x306F;&#x7D50;&#x679C;&#x901A;&#x77E5;&#x3092;&#x305B;&#x305A;&#x306B;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x306E;&#x304C;&#x671B;&#x307E;&#x3057;&#x3044;&#x304C;&#x3001;&#x5B9F;&#x884C;&#x6E08;&#x306E;&#x51E6;&#x7406;&#x3092;&#x306A;&#x304B;&#x3063;&#x305F;&#x3053;&#x3068;&#x306B;&#x3067;&#x304D;&#x306A;&#x3044;&#x5834;&#x5408;&#x3082;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3057;&#x3001;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x7D50;&#x679C;&#x306E;&#x901A;&#x77E5;&#x304C;&#x884C;&#x308F;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x3053;&#x3068;&#x3082;&#x3042;&#x308A;&#x3046;&#x308B;&#x3002;</p>
<ul>
<li>&#x672C;&#x5236;&#x9650;&#x306E;&#x305F;&#x3081;&#x3001;&#x672C;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x300C;&#x540C;&#x4E00;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x4E8C;&#x56DE;&#x4EE5;&#x4E0A;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x300D;&#x5834;&#x5408;&#x304C;&#x3042;&#x308A;&#x3046;&#x308B;&#x3002;</li>
</ul>
</li>
</ul>
</li>
<li><p>&#x8907;&#x6570;&#x306E; Job Queue &#x3092;&#x6271;&#x3046;&#x5834;&#x5408;</p>
<ul>
<li>&#x5148;&#x8FF0;&#x306E;&#x56F3;&#x3067;&#x306F;&#x3001;Job Queue &#x306F;&#x5358;&#x4E00;&#x306E;&#x3082;&#x306E;&#x3092;&#x4F7F;&#x3044;&#x3001;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x306F;&#x5897;&#x6B96;&#x3057;&#x306A;&#x3044;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x305F;&#x3002;</li>
<li>&#x3053;&#x306E;&#x5834;&#x5408;&#x3001;Job Queue &#x304C;&#x6B7B;&#x3093;&#x3067;&#x3057;&#x307E;&#x3046;&#x3068;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5168;&#x4F53;&#x3068;&#x3057;&#x3066;&#x52D5;&#x4F5C;&#x3057;&#x306A;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x305F;&#x3081;&#x3001;&#x8907;&#x6570; Job Queue (&#x30ED;&#x30FC;&#x30C9;&#x30D0;&#x30E9;&#x30F3;&#x30B5;&#x30FC;&#x3082;) &#x3092;&#x304B;&#x307E;&#x3048;&#x308B;&#x3068;&#x5197;&#x9577;&#x6027;&#x304C;&#x5897;&#x3057;&#x3066;&#x5B89;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x601D;&#x308F;&#x308C;&#x308B;&#x3002;<ul>
<li>&#x8907;&#x6570;&#x306E; Job Queue &#x3092;&#x69CB;&#x3048;&#x308B;&#x5834;&#x5408;&#x3001;&#x7A4D;&#x3093;&#x3060;&#x9806;&#x756A;&#x306B;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x5236;&#x7D04;&#x304C;&#x751F;&#x3058;&#x308B;&#x3053;&#x3068;&#x304C;&#x60F3;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3002;</li>
</ul>
</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 本資料について">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="reference.html" class="navigation navigation-next " aria-label="Next page: 参考文献">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"非同期ジョブシステム設計","level":"1.2","depth":1,"next":{"title":"参考文献","level":"1.3","depth":1,"path":"reference.md","ref":"reference.md","articles":[]},"previous":{"title":"本資料について","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["uml","search","codeblock-filename"],"pluginsConfig":{"uml":{"format":"svg","charset":"UTF-8","nailgun":false},"search":{},"codeblock-filename":{},"highlight":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"design.md","mtime":"2019-01-08T05:24:23.884Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-08T05:25:06.381Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

