
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>メモ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-codeblock-filename/block.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="reference.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    本資料について
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="design.html">
            
                <a href="design.html">
            
                    
                    非同期ジョブ実行システム設計
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="reference.html">
            
                <a href="reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="memo.html">
            
                <a href="memo.html">
            
                    
                    メモ
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >メモ</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x30E1;&#x30E2;">&#x30E1;&#x30E2;</h1>
<p>&#x672A;&#x5206;&#x985E;&#x6587;&#x66F8;&#x306F;&#x4E00;&#x65E6;&#x3053;&#x3053;&#x306B;&#x66F8;&#x304F;&#x3002;</p>
<h2 id="&#x8A2D;&#x8A08;&#x3067;&#x8003;&#x3048;&#x305F;&#x70B9;">&#x8A2D;&#x8A08;&#x3067;&#x8003;&#x3048;&#x305F;&#x70B9;</h2>
<h3 id="&#x6982;&#x8981;">&#x6982;&#x8981;</h3>
<ul>
<li><p>&#x30A6;&#x30A7;&#x30D6;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304B;&#x3089;&#x7528;&#x3044;&#x308B;&#x3068;&#x3044;&#x3046;&#x6587;&#x8108;&#x3067;&#x3001;&#x69D8;&#x3005;&#x306A;&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x5B9F;&#x884C;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x8003;&#x3048;&#x308B;&#x3002;</p>
<ul>
<li>&#x8272;&#x3005;&#x306A;&#x30E6;&#x30FC;&#x30B9;&#x30B1;&#x30FC;&#x30B9;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;&#x306A;&#x308B;&#x3079;&#x304F;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x306B;&#x5BC4;&#x3089;&#x306A;&#x3044;&#x8A2D;&#x8A08;&#x306B;&#x3057;&#x305F;&#x3044;&#x3068;&#x8003;&#x3048;&#x308B;&#x3002;</li>
<li>&#x69CB;&#x6210;&#x306F;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x3044;&#x3063;&#x305F;&#x3093;&#x30AD;&#x30E5;&#x30FC;&#x306B;&#x7A4D;&#x307F;&#x3001;&#x9806;&#x6B21;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x51E6;&#x7406;&#x3092;&#x884C;&#x3063;&#x3066;&#x3044;&#x304F;&#x30E2;&#x30C7;&#x30EB;</li>
</ul>
</li>
<li><p>&#x4F7F;&#x3046;&#x5074;&#x304B;&#x3089;&#x3057;&#x3066;&#x307F;&#x305F;&#x3089;&#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x306B;&#x4F7F;&#x3048;&#x308B; API &#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x6295;&#x5165;</li>
<li>&#x30B8;&#x30E7;&#x30D6;&#x53D6;&#x308A;&#x51FA;&#x3057;</li>
<li>&#x30B8;&#x30E7;&#x30D6;&#x72B6;&#x614B;&#x78BA;&#x8A8D;</li>
<li>&#x30B8;&#x30E7;&#x30D6;&#x72B6;&#x614B;&#x5909;&#x66F4;</li>
</ul>
</li>
<li><p>&#x975E;&#x540C;&#x671F;&#x30B8;&#x30E7;&#x30D6;&#x5B9F;&#x884C;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x57FA;&#x76E4;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x305D;&#x308C;&#x306A;&#x308A;&#x306B;&#x6642;&#x9593;&#x304C;&#x639B;&#x304B;&#x308B; (&#x4E00;&#x65E5;&#x3068;&#x304B;) &#x3067;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306A;&#x60F3;&#x5B9A;</p>
</li>
<li><p>&#x30B8;&#x30E7;&#x30D6;&#x5B9F;&#x884C;&#x8005; (&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x3068;&#x547C;&#x3076;) &#x306F;&#x3001;&#x5FC5;&#x8981;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x3069;&#x3093;&#x3069;&#x3093;&#x5897;&#x3084;&#x305B;&#x308B; (&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;) &#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;</p>
<ul>
<li>&#x30AD;&#x30E5;&#x30FC;&#x90E8;&#x5206;&#x306F;&#x4E00;&#x5143;&#x7BA1;&#x7406;&#x3057;&#x305F;&#x3044;&#x95A2;&#x4FC2;&#x4E0A;&#x3001;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x306B;&#x304F;&#x3044;&#x306E;&#x3067;&#x3001;
&#x30AD;&#x30E5;&#x30FC;&#x3068;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x306F;&#x5225;&#x306B;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x304A;&#x304F;</li>
</ul>
</li>
<li><p>&#x30AD;&#x30E5;&#x30FC;&#x306F;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x306B;&#x6C38;&#x7D9A;&#x5316;&#x3059;&#x308B; (DB &#x3092;&#x4F7F;&#x3046;&#x3060;&#x308D;&#x3046;) &#x306E;&#x3067;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x306B;&#x304F;&#x3044;&#x3068;&#x3044;&#x3046;&#x60F3;&#x5B9A;</p>
</li>
</ul>
<h3 id="&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;-&#x540D;&#x524D;&#x5FAE;&#x5999;">&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC; (&#x540D;&#x524D;&#x5FAE;&#x5999;)</h3>
<ul>
<li><p>&#x6295;&#x5165;&#x3055;&#x308C;&#x305F;&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x30AD;&#x30E5;&#x30FC;&#x30A4;&#x30F3;&#x30B0;&#x3057;&#x3066;&#x304A;&#x304F;&#x6A5F;&#x80FD;</p>
<ul>
<li>&#x6295;&#x5165;&#x3055;&#x308C;&#x305F;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x9806;&#x6B21;&#x53D6;&#x308A;&#x51FA;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3059;&#x308B;</li>
</ul>
</li>
<li><p>&#x6295;&#x5165;&#x3055;&#x308C;&#x305F;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x306B;&#x7F6E;&#x304F;&#x306A;&#x3069;&#x3057;&#x3066;&#x6C38;&#x7D9A;&#x5316;&#x3059;&#x308B;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x304C;&#x6B7B;&#x3093;&#x3060;&#x3068;&#x304D;&#x306B;&#x3001;&#x6295;&#x5165;&#x6E08;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x308F;&#x308C;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;</li>
<li>&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x3092;&#x30B9;&#x30B1;&#x30FC;&#x30EB;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3084;&#x3059;&#x3044;</li>
</ul>
</li>
<li><p>&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x72B6;&#x614B;&#x3092;&#x6301;&#x3064;</p>
<ul>
<li><p>&#x5B9F;&#x884C;&#x5F85;&#x3061;</p>
<ul>
<li>&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x306B;&#x3088;&#x3063;&#x3066;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x306E;&#x3092;&#x5F85;&#x3063;&#x3066;&#x3044;&#x308B;&#x72B6;&#x614B;&#x306E;&#x30B8;&#x30E7;&#x30D6;</li>
</ul>
</li>
<li><p>&#x5B9F;&#x884C;&#x4E2D;</p>
<ul>
<li>&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x5B9F;&#x884C;&#x4E2D;&#x306E;&#x30B8;&#x30E7;&#x30D6;</li>
<li>&#x4E00;&#x5B9A;&#x671F;&#x9593;&#x304C;&#x904E;&#x304E;&#x308B;&#x3068;&#x300C;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x300D;&#x306B;&#x623B;&#x308B;</li>
</ul>
</li>
<li><p>&#x6B63;&#x5E38;&#x7D42;&#x4E86;</p>
</li>
<li>&#x5931;&#x6557;&#x7D42;&#x4E86;<ul>
<li>&#x30A8;&#x30E9;&#x30FC;&#x7406;&#x7531;&#x3092;&#x6DFB;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;</li>
</ul>
</li>
</ul>
</li>
<li><p>&#x30AD;&#x30E5;&#x30FC;&#x3068;&#x3044;&#x3044;&#x3064;&#x3064;&#x3001;&#x53D6;&#x308A;&#x51FA;&#x3055;&#x308C;&#x305F;&#x6BB5;&#x968E;&#x3067;&#x5185;&#x5BB9;&#x304C;&#x5931;&#x308F;&#x308C;&#x308B;&#x308F;&#x3051;&#x3067;&#x306F;&#x306A;&#x3044;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x6557;&#x3057;&#x305F;&#x3068;&#x304D;&#x306B;&#x518D;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001;&#x4E00;&#x5EA6;&#x53D6;&#x308A;&#x51FA;&#x3055;&#x308C;&#x3066;&#x3082;&#x5931;&#x308F;&#x308C;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;</li>
<li><p>&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x306B;&#x53D6;&#x308A;&#x51FA;&#x3055;&#x308C;&#x305F;&#x3089;&#x3001;&#x305D;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x300C;&#x5B9F;&#x884C;&#x4E2D;&#x300D;&#x306B;&#x72B6;&#x614B;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;</p>
<ul>
<li>&#x8907;&#x6570;&#x306E;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x540C;&#x3058;&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;</li>
<li>&#x300C;&#x5B9F;&#x884C;&#x4E2D;&#x300D;&#x72B6;&#x614B;&#x306F;&#x3001;&#x4E00;&#x5B9A;&#x306E;&#x6642;&#x9593;&#x304C;&#x904E;&#x304E;&#x308B;&#x3068;&#x89E3;&#x9664;&#x3055;&#x308C;&#x3066;&#x300C;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x300D;&#x306B;&#x623B;&#x308B;<ul>
<li>&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x7D50;&#x679C;&#x3092;&#x901A;&#x77E5;&#x305B;&#x305A;&#x306B;&#x6B7B;&#x3093;&#x3067;&#x3057;&#x307E;&#x3063;&#x305F;&#x308A;&#x3001;&#x7D50;&#x679C;&#x901A;&#x77E5;&#x6642;&#x306B;&#x901A;&#x4FE1;&#x304C;&#x3067;&#x304D;&#x306A;&#x304B;&#x3063;&#x305F;&#x308A;&#x3001;&#x306A;&#x3069;&#x3067;&#x7D50;&#x679C;&#x304C;&#x884C;&#x65B9;&#x4E0D;&#x660E;&#x306B;&#x306A;&#x308B;&#x5834;&#x5408;&#x306B;&#x305D;&#x306A;&#x3048;&#x3066;</li>
<li>&#x3053;&#x306E;&#x4ED5;&#x69D8;&#x306E;&#x305F;&#x3081;&#x3001;&#x300C;&#x540C;&#x4E00;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x4E8C;&#x56DE;&#x4EE5;&#x4E0A;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x3046;&#x308B;&#x300D;&#x3068;&#x3044;&#x3046;&#x5236;&#x9650;&#x304C;&#x751F;&#x3058;&#x308B;&#x3002;</li>
</ul>
</li>
</ul>
</li>
<li><p>&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x6B63;&#x5E38;&#x306B;&#x7D42;&#x4E86;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x306B;&#x300C;&#x5B9F;&#x884C;&#x7D42;&#x4E86;&#x300D;&#x3092;&#x901A;&#x77E5;&#x3059;&#x308B;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x306F;&#x300C;&#x6B63;&#x5E38;&#x7D42;&#x4E86;&#x300D;&#x306B;&#x72B6;&#x614B;&#x5909;&#x66F4;&#x3055;&#x308C;&#x308B;</li>
</ul>
</li>
</ul>
</li>
<li><p>&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x5B9F;&#x884C;&#x3092;&#x5931;&#x6557;&#x3059;&#x308B;&#x5834;&#x5408;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;&#x3059;&#x308B;&#x3002;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x306F;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x5B9F;&#x884C;&#x306B;&#x5931;&#x6557;&#x3057;&#x305F;&#x56DE;&#x6570;&#x3092;&#x8A18;&#x9332;&#x3059;&#x308B;</li>
<li><p>&#x5931;&#x6557;&#x306E;&#x56DE;&#x6570;&#x306F;&#x3001;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x3092;&#x884C;&#x3046;&#x304B;&#x3069;&#x3046;&#x304B;&#x306E;&#x5224;&#x65AD;&#x306B;&#x7528;&#x3044;&#x308B;</p>
<ul>
<li>&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x306F; 5 &#x56DE;&#x884C;&#x3046;&#x3068;&#x3059;&#x308B;</li>
<li><p>&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x6557;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x304B;&#x3064;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x56DE;&#x6570;&#x304C; 5 &#x56DE;&#x306B;&#x6E80;&#x305F;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001;&#x5F53;&#x8A72;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x72B6;&#x614B;&#x3092;&#x300C;&#x5B9F;&#x884C;&#x5F85;&#x3061;&#x300D;&#x306B;&#x5909;&#x66F4;&#x3059;&#x308B;</p>
<ul>
<li>&#x3044;&#x305A;&#x308C;&#x30EF;&#x30FC;&#x30AB;&#x30FC;&#x304C;&#x672C;&#x30B8;&#x30E7;&#x30D6;&#x3092;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x3059;&#x308B;</li>
</ul>
</li>
<li><p>&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x5931;&#x6557;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x304B;&#x3064;&#x30EA;&#x30C8;&#x30E9;&#x30A4;&#x56DE;&#x6570;&#x304C; 5 &#x56DE;&#x306B;&#x9054;&#x3057;&#x3066;&#x3044;&#x305F;&#x5834;&#x5408;&#x3001;&#x5F53;&#x8A72;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x72B6;&#x614B;&#x3092;&#x300C;&#x5931;&#x6557;&#x7D42;&#x4E86;&#x300D;&#x306B;&#x5909;&#x66F4;&#x3059;&#x308B;</p>
<ul>
<li>&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x7BA1;&#x7406;&#x8005;&#x306B;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x9001;&#x4FE1;&#x3059;&#x308B;</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<h3 id="&#x30EF;&#x30FC;&#x30AB;&#x30FC;">&#x30EF;&#x30FC;&#x30AB;&#x30FC;</h3>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x3092;&#x898B;&#x5F35;&#x3063;&#x3066;&#x3044;&#x3066;&#x3001;&#x30B8;&#x30E7;&#x30D6;&#x304C;&#x6295;&#x5165;&#x3055;&#x308C;&#x3066;&#x3044;&#x308C;&#x3070;&#x9806;&#x6B21;&#x53D6;&#x308A;&#x3060;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x6A5F;&#x80FD;</li>
<li><p>&#x898B;&#x5F35;&#x308A;&#x65B9;&#x306F;&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x304B;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x578B;&#x3067;&#x3082; (gRPC &#x3068;&#x304B;&#x30ED;&#x30F3;&#x30B0;&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x3068;&#x304B; WebSocket &#x3068;&#x304B;)</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x6295;&#x5165;&#x304B;&#x3089;&#x5B9F;&#x884C;&#x958B;&#x59CB;&#x307E;&#x3067;&#x306B;&#x591A;&#x5C11;&#x30C7;&#x30A3;&#x30EC;&#x30A4;&#x304C;&#x3042;&#x3063;&#x3066;&#x3082;&#x826F;&#x3044;&#x60F3;&#x5B9A;</li>
<li>&#x4E00;&#x65E5;&#x4E00;&#x56DE;&#x306E;&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x3068;&#x304B;&#x3002;&#x3082;&#x3063;&#x3068;&#x983B;&#x5EA6;&#x304C;&#x9AD8;&#x3051;&#x308C;&#x3070;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x5074;&#x306E;&#x307B;&#x3046;&#x304C;&#x904A;&#x3073;&#x6642;&#x9593;&#x304C;&#x5C11;&#x306A;&#x304F;&#x3066;&#x826F;&#x304F;&#x306A;&#x308A;&#x305D;&#x3046;</li>
</ul>
</li>
<li><p>&#x5B9F;&#x884C;&#x304C;&#x7D42;&#x308F;&#x3063;&#x305F;&#x3089;&#x3001;&#x7D50;&#x679C;&#x3092;&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x306B;&#x8FD4;&#x3059;</p>
<ul>
<li>&#x30B8;&#x30E7;&#x30D6;&#x306E; ID &#x3092;&#x5F15;&#x6570;&#x306B;&#x3057;&#x3066;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x7D50;&#x679C;&#x901A;&#x77E5; API &#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;</li>
</ul>
</li>
</ul>
<h3 id="&#x7D50;&#x679C;&#x901A;&#x77E5;">&#x7D50;&#x679C;&#x901A;&#x77E5;</h3>
<ul>
<li>&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5074;&#x304B;&#x3089;&#x306E;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x3067;&#x306F;&#x306A;&#x304F;&#x5229;&#x7528;&#x5074;&#x304B;&#x3089;&#x306E;&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x3063;&#x3066;&#x884C;&#x3046;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;</li>
<li>&#x4E00;&#x65E5;&#x5358;&#x4F4D;&#x306A;&#x3069;&#x306E;&#x9577;&#x3044;&#x51E6;&#x7406;&#x304C;&#x884C;&#x308F;&#x308C;&#x308B;&#x5834;&#x5408;&#x3001;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x5F35;&#x308A;&#x3063;&#x3071;&#x306A;&#x3057;&#x3088;&#x308A;&#x3082;&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x306E;&#x307B;&#x3046;&#x304C;&#x4ED5;&#x7D44;&#x307F;&#x304C;&#x5358;&#x7D14;&#x3067;&#x5B89;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x601D;&#x3063;&#x305F;&#x305F;&#x3081;</li>
<li>&#x30DD;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x306E;&#x307B;&#x3046;&#x304C;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x9762;&#x3067;&#x306F;&#x4E0D;&#x5229; (&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x5F35;&#x3063;&#x305F;&#x308A;&#x5207;&#x3063;&#x305F;&#x308A;) &#x3068;&#x601D;&#x308F;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;
&#x51E6;&#x7406;&#x304C;&#x77ED;&#x3044;&#x5834;&#x5408;&#x306F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5074;&#x304B;&#x3089;&#x306E;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x3067;&#x3082;&#x826F;&#x3055;&#x305D;&#x3046;</li>
<li>&#x30B8;&#x30E7;&#x30D6;&#x6295;&#x5165;&#x6642;&#x306B;&#x30B8;&#x30E7;&#x30D6;&#x30AD;&#x30E5;&#x30FC;&#x306F;&#x30B8;&#x30E7;&#x30D6;&#x306E; ID &#x3092;&#x8FD4;&#x3059;<ul>
<li>&#x7D50;&#x679C;&#x306E;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x306F;&#x3001;&#x5229;&#x7528;&#x5074;&#x306F;&#x30B8;&#x30E7;&#x30D6; ID &#x3092;&#x5F15;&#x6570;&#x306B;&#x3057;&#x3066;&#x73FE;&#x5728;&#x306E;&#x30B8;&#x30E7;&#x30D6;&#x306E;&#x72B6;&#x614B;&#x3092;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x308B;&#x5F62;</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="reference.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 参考文献">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"メモ","level":"1.4","depth":1,"previous":{"title":"参考文献","level":"1.3","depth":1,"path":"reference.md","ref":"reference.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["uml","search","codeblock-filename"],"pluginsConfig":{"uml":{"format":"svg","charset":"UTF-8","nailgun":false},"search":{},"codeblock-filename":{},"highlight":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"memo.md","mtime":"2019-01-05T14:35:30.161Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-05T14:46:40.414Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

